# Pandas

To manage Series and Dataframes

In [4]:
import pandas as pd

In [6]:
#series => 1D
s=pd.Series([1,2,4,67,43])
s

0     1
1     2
2     4
3    67
4    43
dtype: int64

In [7]:
#dataframe => 2D
data={
    "Name":["A","Ary","Aryan"],
    "Age":[20,23,12]
}
df=pd.DataFrame(data)
df

    Name  Age
0      A   20
1    Ary   23
2  Aryan   12

#reading data
```
pd.read_csv("a.csv")
pd.read_excel("b.xlsx")
pd.read_json("c.json")
pd.read_sql(query,connection)
```

#save data
```
df.to_csv("file.csv",index=False)
```

## Viewing Data

In [12]:
df.head()       # first 5 rows
df.tail()       # last 5 rows
df.shape        # (rows, columns)
df.columns      # column names
df.index        # row labels
df.info()       # data types
df.describe()   # statistics

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

             Age
count   3.000000
mean   18.333333
std     5.686241
min    12.000000
25%    16.000000
50%    20.000000
75%    21.500000
max    23.000000

## Selecting data

In [13]:
df["Age"]
df[["Name", "Age"]]

    Name  Age
0      A   20
1    Ary   23
2  Aryan   12

In [15]:
#by label
df.loc[0]
df.loc[0:2]

    Name  Age
0      A   20
1    Ary   23
2  Aryan   12

In [17]:
#by pos
df.iloc[0]
df.iloc[0:3]  #notice the diff here

    Name  Age
0      A   20
1    Ary   23
2  Aryan   12

In [19]:
#conditional selection
df[df["Age"] > 20]

  Name  Age
1  Ary   23

## Modifying data

In [21]:
#adding new col
df["Salary"] = [20000, 25000, 30000]
df

    Name  Age  Salary
0      A   20   20000
1    Ary   23   25000
2  Aryan   12   30000

In [23]:
df.drop("Age", axis=1)

    Name  Salary
0      A   20000
1    Ary   25000
2  Aryan   30000

In [24]:
df.drop(0, axis=0)

    Name  Age  Salary
1    Ary   23   25000
2  Aryan   12   30000

<p>for permanent change use inplace=True</p>

In [28]:
#missing values
df.isnull()
df.isnull().sum()

Name      0
Age       0
Salary    0
dtype: int64

In [29]:
#remove missing value
df.dropna()

    Name  Age  Salary
0      A   20   20000
1    Ary   23   25000
2  Aryan   12   30000

#filling missing value
```
df.fillna(0)
df.fillna(df.mean())
```

In [31]:
#sorting data
df.sort_values("Age")
df.sort_values("Age", ascending=False)
df.sort_values(["Age", "Salary"])

    Name  Age  Salary
2  Aryan   12   30000
0      A   20   20000
1    Ary   23   25000

#grouping data
```
df.groupby("Department").mean()
df.groupby("Department")["Salary"].sum()
```

In [35]:
#applying
df["Age"].apply(lambda x: x + 1)

0    21
1    24
2    13
Name: Age, dtype: int64

In [37]:
#value counts
df["Age"].value_counts()
df["Age"].unique()
df["Age"].nunique()

3

#correlation/stats
```
df.corr()
df["Age"].mean()
df["Salary"].std()
```

## to Numpy and vice versa

#to numpy
```
df.values
df.to_numpy()
#from numpy
pd.DataFrame(array)
```

#from numpy
```
pd.DataFrame(array)

```